src/DataProcessors/МониторингПарковки/МониторингПарковки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МониторингПарковки</name>
</mdclass:DataProcessor>

src/AccumulationRegisters/ЗанятостьМест/ЗанятостьМест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗанятостьМест</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Территория</name>
    <type>
      <types>CatalogRef.Территории</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Площадка</name>
    <type>
      <types>CatalogRef.Площадки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ряд</name>
    <type>
      <types>CatalogRef.Ряды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Место</name>
    <type>
      <types>CatalogRef.Места</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ВъездНаПарковку/ВъездНаПарковку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВъездНаПарковку</name>
  <registerRecords>AccumulationRegister.ЗанятостьМест</registerRecords>
  <attributes>
    <name>НачальныйПериод</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Место</name>
    <type>
      <types>CatalogRef.Места</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйПериод</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Площадка</name>
    <type>
      <types>CatalogRef.Площадки</types>
    </type>
  </attributes>
  <attributes>
    <name>Ряд</name>
    <type>
      <types>CatalogRef.Ряды</types>
    </type>
  </attributes>
  <attributes>
    <name>Территория</name>
    <type>
      <types>CatalogRef.Территории</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Огранизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/ВыездСПарковки/ВыездСПарковки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыездСПарковки</name>
  <registerRecords>AccumulationRegister.ЗанятостьМест</registerRecords>
  <attributes>
    <name>Площадка</name>
    <type>
      <types>CatalogRef.Площадки</types>
    </type>
  </attributes>
  <attributes>
    <name>Место</name>
    <type>
      <types>CatalogRef.Места</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Ряд</name>
    <type>
      <types>CatalogRef.Ряды</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Огранизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Территория</name>
    <type>
      <types>CatalogRef.Территории</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>DefinedType.Цена</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Цена</types>
    </type>
  </attributes>
</mdclass:Document>

src/Catalogs/ТранспортныеСредства/ТранспортныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТранспортныеСредства</name>
  <attributes>
    <name>Госномер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.МаркиТС</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.МоделиТС</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыТС</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>PFIDМеткаПропуск</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/МониторингПарковки/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Инициализация при создании формы
	ОбновитьТаблицуМестНаСервер();
	ДобавитьЭлементы();
	ЗаполнитьИнформациюОМестах();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьМестаОповещение", ЭтотОбъект);
	УведомленияКлиента.ПодключитьОбработчик("ОбновитьМеста", ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьФормуМеста(Команда)
	
	ИмяМестаИД = Строка(СтрЗаменить(Команда.Имя,"ИмяКнопки_",""));
	СтрокаТаблициМест = ТаблицаМест.Получить(Число(ИмяМестаИД));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Площадка"            , СтрокаТаблициМест.Площадка);
	ПараметрыФормы.Вставить("Место"               , СтрокаТаблициМест.Место);
	ПараметрыФормы.Вставить("Ряд"                 , СтрокаТаблициМест.Ряд);
	ПараметрыФормы.Вставить("ТранспортноеСредство", СтрокаТаблициМест.ТранспортноеСредство);
	ПараметрыФормы.Вставить("Территория"          , СтрокаТаблициМест.Территория);
	ПараметрыФормы.Вставить("НачальныйПериод"     , ТекущаяДата());
	ПараметрыФормы.Вставить("Количество"          , СтрокаТаблициМест.Количество);
	ПараметрыФормы.Вставить("Цена"                , СтрокаТаблициМест.Цена);
	ПараметрыФормы.Вставить("Сумма"               , СтрокаТаблициМест.Сумма);
	
	Если СтрокаТаблициМест.Состояние Тогда
		ОткрытьФорму("Документ.ВъездНаПарковку.Форма.ФормаДокумента", ПараметрыФормы);
	Иначе
		ОткрытьФорму("Документ.ВыездСПарковки.Форма.ФормаДокумента", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьМестаОповещение(Результат, ДопПараметры) Экспорт
	
	ЗаполнитьИнформациюОМестах();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуМестНаСервер()
	
	//Копировал из функции ВыборМест
	
	ТаблицаМест.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Места.Ссылка КАК Место,
	|	Места.Наименование КАК НаименованиеМеста,
	|	Ряда.Ссылка КАК Ряд,
	|	Ряда.Наименование КАК НаименованиеРяда,
	|	Площадка1.Ссылка КАК Площадка,
	|	Площадка1.Наименование КАК НаименованиеПлощадки,
	|	0 КАК Свободно1,
	|	ЗНАЧЕНИЕ(Справочник.ТранспортныеСредства.ПустаяСсылка) КАК ТранспортноеСредство,
	|	Площадка1.Владелец КАК Территория
	|ИЗ
	|	Справочник.Площадки КАК Площадка1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Ряды КАК Ряда
	|		ПО Площадка1.Ссылка = Ряда.Владелец
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Места КАК Места
	|		ПО (Ряда.Ссылка = Места.Владелец)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗанятостьМест.Остатки КАК ЗанятостьМестОстатки
	|		ПО (ЗанятостьМестОстатки.Площадка = Площадка1.Ссылка)
	|			И (ЗанятостьМестОстатки.Территория = Площадка1.Владелец)
	|			И (ЗанятостьМестОстатки.Место = Места.Владелец)
	|ГДЕ
	|	НЕ Ряда.ПометкаУдаления
	|	И НЕ Места.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Площадка,
	|	Ряд,
	|	Место";
	
	ТаблицаМест.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементы()
	
	АдресКартинкиПоУмолчанию = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.МестоСвободно.ПолучитьДвоичныеДанные(),
		ЭтотОбъект.УникальныйИдентификатор);
	
	ШиринаЯчейки = 15;
	ВысотаЯчейки = 15;
	
	ГруппаСетка = Элементы.Добавить("ГруппаСетка", Тип("ГруппаФормы"), Элементы.ГруппаМониторПарковки);
	ГруппаСетка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСетка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ТабПлощадки = ЭтотОбъект.ТаблицаМест.Выгрузить(, "Площадка");
	ТабПлощадки.Свернуть("Площадка");
	Для каждого СтрокаПлощадки Из ТабПлощадки Цикл
		Площадка = СтрокаПлощадки.Площадка;
		
		ПлощадкаИД = Строка(Площадка.УникальныйИдентификатор());
		ПлощадкаИД = СтрЗаменить(ПлощадкаИД, "-", "_");
		ИмяГруппыПлощадка = "ИмяГруппыПлощадка__" + ПлощадкаИД;
		ГруппаПлощадка = Элементы.Добавить(ИмяГруппыПлощадка, Тип("ГруппаФормы"), ГруппаСетка);
		ГруппаПлощадка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаПлощадка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаПлощадка.Заголовок = "";
		//ГруппаПлощадка.Заголовок = "Площадка: " + Площадка.Наименование;
		ЗаголовокПлощадка = Площадка.Наименование;
		
		ПлощадкаОтбор = Новый Структура("Площадка", Площадка);
		ТабРяды = ЭтотОбъект.ТаблицаМест.Выгрузить().Скопировать(ПлощадкаОтбор);
		ТабРяды.Свернуть("Ряд");
		Для каждого СтрокаРяд Из ТабРяды Цикл 
			Ряд = СтрокаРяд.Ряд;
			
			РядИД = Строка(Ряд.УникальныйИдентификатор());
			РядИД = СтрЗаменить(РядИД, "-", "_");
			ИмяГруппыРяд = "ИмяГруппыРяд__" + РядИД;
			ГруппаРяд = Элементы.Добавить(ИмяГруппыРяд, Тип("ГруппаФормы"), ГруппаПлощадка);
			ГруппаРяд.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаРяд.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
			ГруппаРяд.Заголовок = ЗаголовокПлощадка + " : " + Ряд.Наименование;
			
			МестаОтбор = Новый Структура;
			МестаОтбор.Вставить("Площадка", Площадка);
			МестаОтбор.Вставить("Ряд", Ряд);
			МассивМест = ЭтотОбъект.ТаблицаМест.НайтиСтроки(МестаОтбор);
			Для каждого СтрокаМеста Из МассивМест Цикл
				Место = СтрокаМеста.Место;
				
				МестаИД = Строка(Место.УникальныйИдентификатор());
				МестаИД = СтрЗаменить(МестаИД, "-", "_");
				ИмяГруппыМеста = "ИмяГруппыМеста__" + МестаИД;
				
				ГруппаМесто = Элементы.Добавить(ИмяГруппыМеста, Тип("ГруппаФормы"), ГруппаРяд);
				ГруппаМесто.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				ГруппаМесто.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
				ГруппаМесто.Ширина = ШиринаЯчейки;
				ГруппаМесто.Высота = ВысотаЯчейки;
				ГруппаМесто.Заголовок = Место.Наименование;
				
				//ИмяДекорацииМесто = "ДекорацияМесто__" + МестаИД;
				//ДекорацияМесто = Элементы.Добавить(ИмяДекорацииМесто, Тип("ДекорацияФормы"), ГруппаМесто);
				//ДекорацияМесто.Заголовок = Место.Наименование;
				
				ИмяПолеКартинкаТС = "ПолеКартинкаТС__" + МестаИД;
				ПолеКартинкаТС = Элементы.Добавить(ИмяПолеКартинкаТС, Тип("ПолеФормы"), ГруппаМесто);
				ПолеКартинкаТС.Вид = ВидПоляФормы.ПолеКартинки;
				ПолеКартинкаТС.ПутьКДанным = "ТаблицаМест[" + Строка(СтрокаМеста.ПолучитьИдентификатор()) + "].АдресКартинки";
				ПолеКартинкаТС.РазмерКартинки = РазмерКартинки.АвтоРазмер;
				ПолеКартинкаТС.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
				//ПолеКартинкаТС
				
				ИмяГруппаОплата = "ГруппыМестаОплата__" + МестаИД;
				ГруппаОплата = Элементы.Добавить(ИмяГруппаОплата, Тип("ГруппаФормы"), ГруппаМесто);
				ГруппаОплата.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				ГруппаОплата.Заголовок = "";
				ГруппаОплата.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
				//ГруппаОплата.Ширина = ШиринаЯчейки;
				//ГруппаОплата.Высота = ВысотаЯчейки;
				
				ИмяНачалоПериода = "НачалоПериода__" + МестаИД;
				ПолеНачалоПериода = Элементы.Добавить(ИмяНачалоПериода, Тип("ПолеФормы"), ГруппаОплата);
				ПолеНачалоПериода.Вид = ВидПоляФормы.ПолеНадписи;
				ПолеНачалоПериода.Заголовок = "Въезд";
				ПолеНачалоПериода.Формат = "ДФ='dd MMMM yyyy'";
				ПолеНачалоПериода.ПутьКДанным = "ТаблицаМест[" + Строка(СтрокаМеста.ПолучитьИдентификатор()) + "].НачальныйПериод";
				ПолеНачалоПериода.Ширина = 10;
				
				ИмяПолеКоличество = "ПолеКоличество__" + МестаИД;
				ПолеКоличество = Элементы.Добавить(ИмяПолеКоличество, Тип("ПолеФормы"), ГруппаОплата);
				ПолеКоличество.Вид = ВидПоляФормы.ПолеНадписи;
				ПолеКоличество.Заголовок = "Дней";
				ПолеКоличество.ПутьКДанным = "ТаблицаМест[" + Строка(СтрокаМеста.ПолучитьИдентификатор()) + "].Количество";
				ПолеКоличество.Ширина = 3;
				ПолеКоличество.Формат = "ЧН=0";
				
				ИмяПолеЦена = "ПолеЦена__" + МестаИД;
				ПолеЦена = Элементы.Добавить(ИмяПолеЦена, Тип("ПолеФормы"), ГруппаОплата);
				ПолеЦена.Вид = ВидПоляФормы.ПолеНадписи;
				ПолеЦена.ПутьКДанным = "ТаблицаМест[" + Строка(СтрокаМеста.ПолучитьИдентификатор()) + "].Цена";
				ПолеЦена.Ширина = 6;
				ПолеЦена.Формат = "ЧН=0";
				
				ИмяПолеСумма = "ПолеСумма__" + МестаИД;
				ПолеПолеСумма = Элементы.Добавить(ИмяПолеСумма, Тип("ПолеФормы"), ГруппаОплата);
				ПолеПолеСумма.Вид = ВидПоляФормы.ПолеНадписи;
				ПолеПолеСумма.ПутьКДанным = "ТаблицаМест[" + Строка(СтрокаМеста.ПолучитьИдентификатор()) + "].Сумма";
				ПолеПолеСумма.Ширина = 10;
				ПолеПолеСумма.Формат = "ЧН=0";
				
				ИмяДекорацииТС = "ДекорацияТС__" + МестаИД;
				ДекорацияТС = Элементы.Добавить(ИмяДекорацииТС, Тип("ДекорацияФормы"), ГруппаМесто);
				
				Если СтрокаМеста.Состояние Тогда
					ГруппаМесто.ЦветФона = Новый Цвет(0, 255, 127); // Зеленый - свободно
					ДекорацияТС.Видимость = Ложь;
				Иначе
					ГруппаМесто.ЦветФона = Новый Цвет(255, 128, 114); // Красный - занято
					Если НЕ СтрокаМеста.ТранспортноеСредство = Неопределено И НЕ СтрокаМеста.ТранспортноеСредство.Пустая() Тогда
						ДекорацияТС.Заголовок = СтрокаМеста.ТранспортноеСредство.Наименование 
							+ "(" + СтрокаМеста.Контрагент.Наименование + ")";
						ДекорацияТС.Видимость = Истина;
						СтрокаМеста.АдресКартинки = ПолучитьНавигационнуюСсылку(СтрокаМеста.ТранспортноеСредство.Ссылка, "ДанныеФайлаКартинки");
					Иначе
						ДекорацияТС.Видимость = Ложь;
						СтрокаМеста.АдресКартинки = АдресКартинкиПоУмолчанию;
					КонецЕсли;
				КонецЕсли;
				
				ИмяКнопки = "ИмяКнопки__" + МестаИД;
				НомерСтроки = Строка(СтрокаМеста.ПолучитьИдентификатор());
				КомандаМесто = Команды.Добавить("ИмяКнопки_" + НомерСтроки);
				КомандаМесто.Действие = "ОткрытьФормуМеста";
				КомандаМесто.Заголовок = ?(СтрокаМеста.Состояние,"Занять","Освободить");
				КнопкаМесто = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), ГруппаМесто);
				КнопкаМесто.ИмяКоманды = КомандаМесто.Имя;
				КнопкаМесто.Ширина = 18;
				КнопкаМесто.Высота = 2;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюОМестах()
	
	Для Каждого СтрокаТаблицы Из ТаблицаМест Цикл
		Результат = РегистрыНакопления.ЗанятостьМест.ИнформацияОМесте(СтрокаТаблицы.Место);
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Результат,,"Площадка,Ряд,Место");
		ОбновитьЭлементыМеста(СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыМеста(СтрокаМеста)
	
	МестаИД = Строка(СтрокаМеста.Место.УникальныйИдентификатор());
	МестаИД = СтрЗаменить(МестаИД, "-", "_");
	ИмяГруппыМеста = "ИмяГруппыМеста__" + МестаИД;
	ГруппаМесто = Элементы.Найти(ИмяГруппыМеста);
	
	ИмяДекорацииТС = "ДекорацияТС__" + МестаИД;
	ДекорацияТС = Элементы.Найти(ИмяДекорацииТС);
	
	ИмяКнопки = "ИмяКнопки__" + МестаИД;
	КнопкаМесто = Элементы.Найти(ИмяКнопки);
	
	Если СтрокаМеста.Состояние Тогда
		ГруппаМесто.ЦветФона = Новый Цвет(0, 255, 127); // Зеленый - свободно
		ДекорацияТС.Видимость = Ложь;
		КнопкаМесто.Заголовок = "Занять";
	Иначе
		ГруппаМесто.ЦветФона = Новый Цвет(255, 128, 114); // Красный - занято
		Если НЕ СтрокаМеста.ТранспортноеСредство = Неопределено И НЕ СтрокаМеста.ТранспортноеСредство.Пустая() Тогда
			ДекорацияТС.Заголовок = СтрокаМеста.ТранспортноеСредство.Наименование 
							+ " (" + СтрокаМеста.Контрагент.Наименование + ")";
			ДекорацияТС.Видимость = Истина;
			СтрокаМеста.АдресКартинки = ПолучитьНавигационнуюСсылку(СтрокаМеста.ТранспортноеСредство.Ссылка, "ДанныеФайлаКартинки");
		Иначе
			ДекорацияТС.Видимость = Ложь;
			СтрокаМеста.АдресКартинки = АдресКартинкиПоУмолчанию;
		КонецЕсли;
		КнопкаМесто.Заголовок = "Освободить";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьМестаКоманда(Команда)
	ЗаполнитьИнформациюОМестах();
КонецПроцедуры

&НаСервере
Функция ВыборкаМест()

	ТаблицаМест.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Места.Ссылка КАК Место,
	|	Места.Наименование КАК НаименованиеМеста,
	|	Ряда.Ссылка КАК Ряд,
	|	Ряда.Наименование КАК НаименованиеРяда,
	|	Площадка1.Ссылка КАК Площадка,
	|	Площадка1.Наименование КАК НаименованиеПлощадки,
	|	ВЫБОР
	|		КОГДА ЗанятостьМестОстатки.СостояниеОстаток > 0
	|			ТОГДА 1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Свободно,
	|	ЗНАЧЕНИЕ(Справочник.ТранспортныеСредства.ПустаяСсылка) КАК ТранспортноеСредство
	|ИЗ
	|	Справочник.Площадки КАК Площадка1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Ряды КАК Ряда
	|		ПО Площадка1.Ссылка = Ряда.Владелец
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Места КАК Места
	|		ПО Ряда.Ссылка = Места.Владелец
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗанятостьМест.Остатки КАК ЗанятостьМестОстатки
	|		ПО ЗанятостьМестОстатки.Площадка = Площадка1.Ссылка
	|		И ЗанятостьМестОстатки.Территория = Площадка1.Владелец
	|		И ЗанятостьМестОстатки.Место = Места.Владелец
	|ГДЕ
	|	НЕ Ряда.ПометкаУдаления
	|	И НЕ Места.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Площадка,
	|	Ряд,
	|	Место
	|ИТОГИ
	|ПО
	|	Площадка,
	|	Ряд";
	
		
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
КонецФункции

#КонецОбласти
